Repository: AliEl-Saka/Circle-Sync
Catalog: lib/l10n/intl_*.arb
Languages: ar

# ChooseSignUpMethodViewTitleOne
source: Welcome To
ar: اهلاً بك في

# ChooseSignUpMethodViewTitleTwo
source: CircleSync!
ar: سيركل سينك!

# ChooseSignUpMethodViewSubTitle
source: Join our community to share, discover, and connect with like-minded individuals worldwide.
ar: انضم إلى مجتمعنا للمشاركة، واكتشاف، والاتصال بأفراد ذوي الاهتمامات المماثلة حول العالم.

# ChooseSignUpMethodViewFaceBookCard
source: Register with Facebook
ar: التسجيل عبر فيسبوك

# ChooseSignUpMethodViewGmailCard
source: Register with Gmail
ar: التسجيل عبر جيميل

# ChooseSignUpMethodViewOr
source: Or
ar: أو

# ChooseSignUpMethodViewEmailCard
source: Register with email
ar: التسجيل عبر الايميل

# ChooseSignUpMethodViewPhoneCard
source: Register with phone number
ar: التسجيل عبر رقم الهاتف

# ChooseSignUpMethodViewAlradyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# ChooseSignUpMethodViewLogIn
source: Log in
ar: سجل دخولك

# SignUpWithEmailOrPhoneViewCreateYourAccount
source: Create Your
ar: انشئ حسابك

# SignUpWithEmailOrPhoneViewNow
source: Account
ar: الأن

# SignUpWithEmailOrPhoneViewEmail
source: Email
ar: الايميل

# SignUpWithEmailOrPhoneViewPhone
source: Phone Number
ar: رقم الهاتف

# SignUpWithEmailOrPhoneViewName
source: Name
ar: الأسم

# SignUpWithEmailOrPhoneViewPassword
source: Password
ar: كلمه السر

# SignUpWithEmailOrPhoneViewConfirmPassword
source: Confirm Password
ar: تأكيد كلمه السر

# SignUpWithEmailOrPhoneViewContinue
source: Continue
ar: اكمال التسجيل

# SignUpWithEmailOrPhoneViewPasswordDialogTitle
source: Password must meet the following requirements:
ar: كلمة المرور يجب أن تستوفي المتطلبات التالية

# SignUpWithEmailOrPhoneViewPasswordDialogFirst
source: • Be at least eight characters
ar: • تكون على الأقل ثمانية أحرف

# SignUpWithEmailOrPhoneViewPasswordDialogSecond
source: • at least one letter
ar: • تحتوي على حرف واحد على الأقل

# SignUpWithEmailOrPhoneViewPasswordDialogThird
source: • at least one capital letter
ar: • تحتوي على حرف كبير واحد على الأقل

# SignUpWithEmailOrPhoneViewPasswordDialogFourth
source: • at least one number
ar: • تحتوي على رقم واحد على الأقل

source: OTP Verification
ar: رمز التحقق

# OtpVerificationHasBeenSentTo
source: A Verification Code has been sent to
ar: تم ارسال كود التفعيل الي

# OtpVerificationCodeSend
source: Code will be send in
ar: سيتم ارسال الكود خلال

# OtpVerificationDidnotReceiveCode
source: Didn't receive code?
ar: لم تستقبل أي كود؟

# OtpVerificationRequestResend
source: Resend
ar: اعاده الارسال

# OtpVerificationRequestRegister
source: Register
ar: تسجيل
